[
  {
    "id": "Blink-Mini-2-Power-Adapter-White",
    "title": "Blink Mini 2 + Weather Resistant Adapter — Plug-in smart security camera, indoor/outdoor, HD night view in color, built-in spotlight, two-way audio, motion detection, Works with Alexa (White)",
    "img": "https://m.media-amazon.com/images/I/41-0kel5P2L._SY300_SX300_.jpg",
    "description": "Mini 2 is our second generation plug-in smart security camera that helps you stay connected to what’s happening in your home, right from your smartphone. See and speak from the Blink app — Experience 1080p HD live view, night view in color with a built-in spotlight, a wider field of view, and crisp two-way audio. Stream live video continuously for up to 90 minutes with a Blink Subscription Plan (sold separately). Outdoor use — Plug in Mini 2 outside your home with the Blink Weather Resistant Power Adapter (sold separately or as part of a bundle) and mount with the included kit. Motion detection — Get real-time motion alerts on your smartphone so you can react and engage from anywhere. Smart notifications — Get intelligent alerts including person detection with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately). Easy set up — Install your camera in just minutes to help provide full home coverage. Doorbell chime — Use Mini 2 as a plug-in chime for Blink Video Doorbell (sold separately). Hear a real-time alert from Mini 2 when someone presses your Blink Video Doorbell."
  },
  {
    "id": "Blink-Mini-2-Camera-Black",
    "title": "Blink Mini 2 (newest model), Plug-in smart security camera, HD night view in color, built-in spotlight, two-way audio, motion detection, Works with Alexa (Black)",
    "img": "https://m.media-amazon.com/images/I/51eCSeQi2uL._SY300_SX300_.jpg",
    "description": "Mini 2 is our second generation plug-in smart security camera that helps you stay connected to what’s happening in your home, right from your smartphone. See and speak from the Blink app — Experience 1080p HD live view, night view in color with a built-in spotlight, a wider field of view, and crisp two-way audio. Stream live video continuously for up to 90 minutes with a Blink Subscription Plan (sold separately). Outdoor use — Plug in Mini 2 outside your home with the Blink Weather Resistant Power Adapter (sold separately or as part of a bundle) and mount with the included kit. Motion detection — Get real-time motion alerts on your smartphone so you can react and engage from anywhere. Smart notifications — Get intelligent alerts including person detection with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately). Easy set up — Install your camera in just minutes to help provide full home coverage. Doorbell chime — Use Mini 2 as a plug-in chime for Blink Video Doorbell (sold separately). Hear a real-time alert from Mini 2 when someone presses your Blink Video Doorbell."
  },
  {
    "id": "Blink--Mini-2-Power-Adpater",
    "title": "Blink Weather Resistant 13ft Power Adapter for Blink Mini 2 and Blink Outdoor 4 (White)",
    "img": "https://m.media-amazon.com/images/I/31nsUnzQdtL._SX300_SY300_QL70_ML2_.jpg",
    "description": "Weather Resistant Power Adapter enables Blink Mini 2 for outdoor use and provides nonstop power for Blink Outdoor 4 (4th Gen) camera. Do more with Blink — Compatible with USB-C enabled Blink devices, including Mini 2 and Outdoor 4. Peace of mind, rain or shine — Weather resistant for trusted outdoor usage. Includes one 13ft power adapter. Requires access to a standard outlet."
  },
  {
    "id": "tcl-fire-tv-75-inch-class-s5-4k-smart-tv",
    "title": "TCL 75-Inch Class S5 UHD 4K LED Smart TV with Fire TV (75S551F, 2024 Model), Dolby Vision, HDR PRO+, Dolby Atmos, Alexa Built-in with Voice Remote, Apple AirPlay 2 Compatibility, Streaming Television",
    "img": "https://m.media-amazon.com/images/I/71ByP+FObYL._AC_SY300_SX300_.jpg",
    "description": "4K UltraHD Resolution - Experience incredible detail with 4X the resolution of 1080p Full HDTVs. High Brightness LED Backlight - Enjoy a brilliant picture in any room. Enhanced Color - Enhanced color bringing rich, vibrant images to life. Motion Rate 240 with MEMC Frame Insertion - Combines multiple motion enhancement technologies for best-in-class motion clarity. Fire TV Experience – All your entertainment in one place. Fire TV gives you quick access to live TV, video games, music, and lets you stream over 1 million movies and TV episodes. Subscriptions may apply. Game Accelerator 120 - With up to fast 120 Hz VRR, enjoy more responsive gameplay without lag, designed to keep you at the top of any leaderboard. HDR PRO+ with Dolby Vision, HDR10+, HDR10, & HLG - Enjoy enhanced contrast, accurate colors and fine details utilizing all the most advanced HDR formats."
  },
  {
    "id": "Blink-Mini-2-With-Weather-Resistant-Power-Adapter-Black",
    "title": "Blink Mini 2 + Weather Resistant Adapter — Plug-in smart security camera, indoor/outdoor, HD night view in color, built-in spotlight, two-way audio, motion detection, Works with Alexa (Black)",
    "img": "https://m.media-amazon.com/images/I/41B1BUCK6bL._SY300_SX300_.jpg",
    "description": "Mini 2 is our second generation plug-in smart security camera that helps you stay connected to what’s happening in your home, right from your smartphone. See and speak from the Blink app — Experience 1080p HD live view, night view in color with a built-in spotlight, a wider field of view, and crisp two-way audio. Stream live video continuously for up to 90 minutes with a Blink Subscription Plan (sold separately). Outdoor use — Plug in Mini 2 outside your home with the Blink Weather Resistant Power Adapter (sold separately or as part of a bundle) and mount with the included kit. Motion detection — Get real-time motion alerts on your smartphone so you can react and engage from anywhere. Smart notifications — Get intelligent alerts including person detection with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately). Easy set up — Install your camera in just minutes to help provide full home coverage. Doorbell chime — Use Mini 2 as a plug-in chime for Blink Video Doorbell (sold separately). Hear a real-time alert from Mini 2 when someone presses your Blink Video Doorbell."
  },
  {
    "id": "Amazon-release-vibrant-helpful-routines",
    "title": "Amazon Echo Dot (newest model), Vibrant sounding Alexa speaker, Great for bedrooms, dining rooms and offices, Glacier White",
    "img": "https://m.media-amazon.com/images/I/7116ea3BmTL._AC_SY300_SX300_.jpg",
    "description": "Our best sounding Echo Dot yet – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room. Your favorite music and content – Play music, audiobooks, and podcasts from Amazon Music, Apple Music, Spotify and others or via Bluetooth throughout your home. Alexa is happy to help – Ask Alexa for weather updates and to set hands-free timers, get answers to your questions and even hear jokes. Need a few extra minutes in the morning? Just tap your Echo Dot to snooze your alarm. Keep your home comfortable – Control compatible smart home devices with your voice and routines triggered by built-in motion or indoor temperature sensors. Create routines to automatically turn on lights when you walk into a room, or start a fan if the inside temperature goes above your comfort zone. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls, including a mic off button. Do more with device pairing– Fill your home with music using compatible Echo devices in different rooms, create a home theatre system with Fire TV, or extend wifi coverage with a compatible eero network so you can say goodbye to drop-offs and buffering."
  },
  {
    "id": "Certified-Refurbished-Remote-controls-streaming",
    "title": "Like-New Fire TV Stick Lite, free and live TV, Alexa Voice Remote Lite, smart home controls, HD streaming",
    "img": "https://m.media-amazon.com/images/I/514OehRWtdL._AC_SY300_SX300_.jpg",
    "description": "Like-New Amazon Fire Tv Stick Lite refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Like-New Amazon devices may be packaged in generic Amazon-branded boxes. Our most affordable Fire TV streaming stick - Enjoy fast streaming in Full HD. Comes with Alexa Voice Remote Lite. Great for new users - Start streaming with access to over 200,000 free movies and TV episodes from ad-supported streaming apps like Freevee, Tubi, Pluto TV, and more. Easy to set up, stays hidden - Plug in behind your TV, turn on the TV, and connect to the internet to get set up. Press and ask Alexa - Use your voice to easily search and launch shows across multiple apps. Endless entertainment - Stream more than 1 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Live TV - Watch your favorite live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others."
  },
  {
    "id": "Amazon_Fire_HD_10",
    "title": "Amazon Fire HD 10 tablet (newest model) built for relaxation, 10.1\" vibrant Full HD screen, octa-core processor, 3 GB RAM, 32 GB, Black",
    "img": "https://m.media-amazon.com/images/I/61EfgCU1k7L._AC_SY300_SX300_.jpg",
    "description": "Do what you love, uninterrupted — 25% faster performance than the previous generation and 3 GB RAM are ideal for seamless streaming, reading, and gaming. High-def entertainment — A 10.1\" 1080p Full HD display brings brilliant color to all your shows and games. Binge watch longer with 13-hour battery, 32 or 64 GB of storage, and up to 1 TB expandable storage with micro-SD card (sold separately). Thin, light, durable — Tap into entertainment from anywhere with a lightweight, durable design and strengthened glass made from aluminosilicate glass. As measured in a tumble test, Fire HD 10 is 2.7 times as durable as the Samsung Galaxy Tab A8 (2022). Stay up to speed — Use the 5 MP front-facing camera to Zoom with family and friends, or create content for social apps like Instagram and TikTok. Ready when inspiration strikes — With 4,096 levels of pressure sensitivity, the Made for Amazon Stylus Pen (sold separately) offers a natural writing experience that responds to your handwriting. Use it to write, sketch in apps like OneNote, and more. Save time, get creative - Enjoy three new smart tools to help you send polished emails, quickly summarize webpages, and create unique wallpapers. Family friendly — Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more."
  },
  {
    "id": "Blink-Outdoor-4th-Gen-3-Camera",
    "title": "Blink Outdoor 4 (newest model), Wire-free smart security camera, two-year battery life, two-way audio, HD live view, enhanced motion detection, Works with Alexa – 3 camera system",
    "img": "https://m.media-amazon.com/images/I/41kmmUXYU9L._SY300_SX300_.jpg",
    "description": "Outdoor 4 is our fourth generation wireless smart security camera that helps you protect your home inside and out right from your smartphone. See and speak from the Blink app — Experience 1080p HD live view, infrared night vision, and crisp two-way audio. Two-year battery life — Set up yourself in minutes and get up to two years of power with the included AA lithium batteries. Enhanced motion detection — Be alerted to motion faster from your smartphone with dual-zone, enhanced motion detection. Person detection — Get alerts when a person is detected with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately). Save and share clips — Choose to store events in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (included) plus a USB drive (sold separately). Works with Alexa — Connect to an Alexa-enabled device to engage live view, arm and disarm your system, and more using your voice. Includes three Outdoor 4 cameras, one Sync Module 2, six AA lithium metal batteries, three mounting kits, one USB cable, and one power adapter."
  },
  {
    "id": "Blink-Indoor-Wireless-Security-Camera-Add-on",
    "title": "Blink Indoor - wireless, HD security camera with two-year battery life, motion detection, and two-way audio – Add-on camera (Sync Module required)",
    "img": "https://m.media-amazon.com/images/I/41WQilf1O8L._SY300_SX300_.jpg",
    "description": "Blink Indoor is a wireless, battery-powered security camera that helps you check in on your home day or night with infrared night vision. With long-lasting battery life, Indoor runs for up to two years on two AA lithium batteries (included). Store video clips and photos in the cloud with the Blink Subscription Plan and save events locally to the Blink Sync Module 2 via a USB flash drive (sold separately). Get customizable motion alerts on your phone through the Blink Home Monitor app so you’re only alerted when you need to be. See, hear, and speak to people and pets in your home with live view in real time and two-way audio features in the Blink app. Designed so you can set up yourself in minutes. No wiring, no professional installation required. Works with Alexa – use your voice to monitor your home through supported Alexa-enabled devices."
  },
  {
    "id": "Certified-Refurbished-display-motion-Charcoal",
    "title": "Like-New Echo Show 10 (3rd Gen) | HD smart display with motion and Alexa | Charcoal",
    "img": "https://m.media-amazon.com/images/I/61MAaDuEyJS._AC_SY300_SX300_.jpg",
    "description": "Like-New Echo Show 10 (3rd Gen) is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Like-New Amazon devices may be packaged in generic Amazon-branded boxes. Alexa can show you even more - With a 10.1\" HD screen that’s designed to move with you, video calls, recipes, and shows are always in view. The speakers deliver premium, directional sound. Stay in frame - Video call friends and family or take a picture while the 13MP camera with auto-framing and motion keeps you front and center. Smart home made simple - Set up compatible Zigbee devices or smart products without a separate hub. Ask Alexa to show you security cameras, control lights, and adjust thermostats. Take a look around when you’re away - Securely access the built-in camera to remotely monitor your home anytime with the Alexa app or other Echo Show devices. So much entertainment - Ask Alexa to play your favorite shows, music, and podcasts from Prime Video, Netflix, Amazon Music, Spotify, and more. The ultimate kitchen companion - Cook along with recipes on Food Network Kitchen, get unit conversions, set timers, add to your grocery list, and multitask with ease."
  },
  {
    "id": "Blink--Mini-2-Power-Adpater",
    "title": "Blink Weather Resistant 13ft Power Adapter for Blink Mini 2 and Blink Outdoor 4 (Black)",
    "img": "https://m.media-amazon.com/images/I/31Y1xSOteFL._SX300_SY300_QL70_ML2_.jpg",
    "description": "Weather Resistant Power Adapter enables Blink Mini 2 for outdoor use and provides nonstop power for Blink Outdoor 4 (4th Gen) camera. Do more with Blink — Compatible with USB-C enabled Blink devices, including Mini 2 and Outdoor 4. Peace of mind, rain or shine — Weather resistant for trusted outdoor usage. Includes one 13ft power adapter. Requires access to a standard outlet."
  },
  {
    "id": "Amazon-Kindle-Case",
    "title": "Amazon Kindle Case, Thin and Lightweight, Foldable Protective Cover - Fabric",
    "img": "https://m.media-amazon.com/images/I/81Tj7EKA+OL._AC_SY300_SX300_.jpg",
    "description": "Designed to perfectly fit your new Kindle (Fits 2024 and 2022 Releases only). Opens and closes like a book to wake your Kindle or put it to sleep. Thin and lightweight design allows for hours of comfortable reading. Cover folds back for easy one-handed reading. It can remain on your Kindle for charging. Magnetic attachment ensures cover is securely closed. Premium fabric with microfiber interior protects your screen and keeps it clean. Made with 51% post-consumer recycled plastics and 67% post-consumer recycled fabric. This accessory’s packaging is 100% recyclable. Fulfillment center packaging not included."
  },
  {
    "id": "2-Year-Protection-Plan-Echo-release",
    "title": "2-Year Protection Plan for Echo Pop (2023 release)",
    "img": "https://m.media-amazon.com/images/I/51FP40nrhbL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "description": "Only compatible with Echo Pop (2023 release) purchased within the last 30 days Make up to 3 claims during the term of your warranty No deductibles or shipping fees Receive a replacement device 2 to 3 days after you make a valid claim Your Protection Plan will be delivered via e-mail within 24 hours Your card will be charged immediately, plan starts when device is delivered Cancel anytime, full refund in first 90 days Fully transferable with gifts"
  },
  {
    "id": "Ring-Battery-Weather-Resistant-Outdoor-Two-way",
    "title": "Ring Stick Up Cam Battery | Weather-Resistant Outdoor Camera, Live View, Color Night Vision, Two-way Talk, Motion alerts, Works with Alexa | 3-Pack | Black",
    "img": "https://m.media-amazon.com/images/I/318R0S3VYCL._SX300_SY300_QL70_ML2_.jpg",
    "description": "See, hear and speak to people from your phone, tablet or select Echo device with Stick Up Cam Battery, a battery-powered camera that can be mounted indoor or out. With Live View, you can check in on your home any time through the Ring app. Save your recorded videos for up to 180 days to rewatch any time, get alerts for people and package, and so much more with a Ring Home subscription (sold separately). Place on a flat surface or mount to a wall with the versatile mounting bracket. Add-on the Mount for Stick Up Cam (sold separately) for ceiling mount. Watch over your entire home by connecting one or multiple Stick Up Cams to all your Ring devices in the Ring app. Easily setup Stick Up Cam Battery by inserting the battery pack and connecting to Wi-Fi. For added peace of mind, pair with Alexa to help you keep an eye on your home."
  },
  {
    "id": "Blink-Outdoor-4th-Gen-1-Camera",
    "title": "Blink Outdoor 4 (newest model), Wire-free smart security camera, two-year battery life, two-way audio, HD live view, enhanced motion detection, Works with Alexa – 1 camera system",
    "img": "https://m.media-amazon.com/images/I/41kmmUXYU9L._SY300_SX300_.jpg",
    "description": "Outdoor 4 is our fourth generation wireless smart security camera that helps you protect your home inside and out right from your smartphone. See and speak from the Blink app — Experience 1080p HD live view, infrared night vision, and crisp two-way audio. Two-year battery life — Set up yourself in minutes and get up to two years of power with the included AA lithium batteries. Enhanced motion detection — Be alerted to motion faster from your smartphone with dual-zone, enhanced motion detection. Person detection — Get alerts when a person is detected with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately). Save and share clips — Choose to store events in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (included) plus a USB drive (sold separately). Works with Alexa — Connect to an Alexa-enabled device to engage live view, arm and disarm your system, and more using your voice. Includes one Outdoor 4 camera, one Sync Module 2, two AA lithium metal batteries, one mounting kit, one USB cable, and one power adapter."
  },
  {
    "id": "amazon-fire-tv-stick-hd",
    "title": "Amazon Fire TV Stick HD (newest model), free and live TV, Alexa Voice Remote, smart home controls, HD streaming",
    "img": "https://m.media-amazon.com/images/I/61weCavnG7L._AC_SY300_SX300_.jpg",
    "description": "Stream in Full HD - Enjoy fast, affordable streaming in Full HD, and control it all with the Alexa Voice Remote. Great for first-time streaming - Streaming has never been easier with access to over 300,000 free movies and TV episodes from ad-supported streaming apps like Amazon Freevee, Tubi, Pluto TV, and more. Press and ask Alexa - Use your voice to easily search and launch shows across multiple apps. Endless entertainment - Stream more than 1.5 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply. App buttons may vary. Take it anywhere - Connect to any TV's HDMI port to access your entertainment apps and enjoy them on the go. Watch live - Get live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Play your favorite songs - Listen on Amazon Music, Spotify, Pandora, and others. Subscription fees may apply. Control your compatible smart home - Ask Alexa to check weather, dim the lights, view live camera feeds, stream music, and more."
  },
  {
    "id": "All-new-Amazon-Kindle-Paperwhite-glare-free",
    "title": "All-new Amazon Kindle Paperwhite (16 GB) – Our fastest Kindle ever, with new 7\" glare-free display and weeks of battery life – Black",
    "img": "https://m.media-amazon.com/images/I/81qEq4MEnJL._AC_SY300_SX300_.jpg",
    "description": "Our fastest Kindle ever – The next-generation 7“ Paperwhite display has a higher contrast ratio and 25% faster page turns. Ready for travel – The ultra-thin design has a larger glare-free screen so pages stay sharp no matter where you are. Escape into your books – Your Kindle doesn’t have social media, notifications, or other distracting apps. Battery life for your longest novel – A single charge via USB-C lasts up to 12 weeks. Read in any light – Adjust the display from white to amber to read in bright sunlight or in the dark. Waterproof and worry-free – Take your stories by the pool, in the bath, or anywhere in between. Massive selection – Instantly access over 15 million titles in the Kindle Store worldwide, and add a Kindle Unlimited subscription for all-you-can read access to a catalog including best sellers."
  },
  {
    "id": "All-new-Amazon-Kindle-Paperwhite-glare-free",
    "title": "All-new Amazon Kindle Paperwhite (16 GB) – Our fastest Kindle ever, with new 7\" glare-free display, and weeks of battery life – Without lockscreen ads – Black",
    "img": "https://m.media-amazon.com/images/I/81qEq4MEnJL._AC_SY300_SX300_.jpg",
    "description": "Our fastest Kindle ever – The next-generation 7“ Paperwhite display has a higher contrast ratio and 25% faster page turns. Ready for travel – The ultra-thin design has a larger glare-free screen so pages stay sharp no matter where you are. Escape into your books – Your Kindle doesn’t have social media, notifications, or other distracting apps. Battery life for your longest novel – A single charge via USB-C lasts up to 12 weeks. Read in any light – Adjust the display from white to amber to read in bright sunlight or in the dark. Waterproof and worry-free – Take your stories by the pool, in the bath, or anywhere in between. Massive selection – Instantly access over 15 million titles in the Kindle Store worldwide, and add a Kindle Unlimited subscription for all-you-can read access to a catalog including best sellers."
  },
  {
    "id": "Amazon-Kindle",
    "title": "New Amazon Kindle (16 GB) - Lightest and most compact Kindle, with glare-free display, faster page turns, adjustable front light, and long battery life - Black",
    "img": "https://m.media-amazon.com/images/I/61AdPVQCYDL._AC_SY300_SX300_.jpg",
    "description": "The lightest and most compact Kindle - Now with a brighter front light at max setting, higher contrast ratio, and faster page turns for an enhanced reading experience. Effortless reading in any light - Read comfortably with a 6“ glare-free display, adjustable front light—now 25% brighter at max setting—and dark mode. Escape into your books - Tune out messages, emails, and social media with a distraction-free reading experience. Read for a while - Get up to 6 weeks of battery life on a single charge. Take your library with you - 16 GB storage holds thousands of books. Find new stories - A Kindle Unlimited subscription unlocks access to over 4 million titles, thousands of audiobooks, and more. Designed with sustainability in mind - This Kindle uses 75% recycled plastics and 90% recycled magnesium, and has 100% recyclable device packaging."
  }
]